1c-enterprise/Documents/ProcurementRequisition.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ProcurementRequisition</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.RFQKeys</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Suppliers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Companies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Contract</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Contracts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RFQKey</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.RFQKey</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Item</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Items</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UnitOfMeasure</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UOM</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Questions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Question</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Questions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c-enterprise/Documents/ProcurementRequisition/Forms/DocumentForm/Ext/Form/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
		
	RFQInterfaceURL = Constants.RFQInterfaceURL.Get();
	
	FillAdditionalColumnsOfSuppliers();
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	
	FillAdditionalColumnsOfSuppliers();
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersSuppliers

&AtClient
Procedure SuppliersSelection(Item, SelectedRow, Field, StandardProcessing)
	
	If Field = Items.SuppliersRFQURL Then
		
		StandardProcessing = False;
		
		RFQURL = Items.Suppliers.CurrentData.RFQURL;
		
		If ValueIsFilled(RFQURL) Then	
			GotoURL(RFQURL);
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure FillAdditionalColumnsOfSuppliers()
	
	For Each Line In Object.Suppliers Do
		
		IsAbleToFill = 
			ValueIsFilled(RFQInterfaceURL)
			And ValueIsFilled(Line.RFQKey);
		
		If IsAbleToFill Then
			Line.RFQURL = StrTemplate("%1/%2", RFQInterfaceURL, Line.RFQKey);
		Else
			Line.RFQURL = "";
		EndIf;
		
	EndDo;

EndProcedure

#EndRegion
